## Production: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                    |
|--------|---------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.postgresql_dangerous_queries[0]`  |
|        | `aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.postgresql_dangerous_queries[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "postgresql_dangerous_queries" {
      + destination_arn = "arn:aws:lambda:ca-central-1:296255494825:function:sentinel-cloud-watch-forwarder"
      + distribution    = "Random"
      + filter_pattern  = "[(w1=\"*ALTER *\" || w1=\"*CREATE *\" || w1=\"*DROP *\" || w1=\"*GRANT *\" || w1=\"*REVOKE *\" || w1=\"*TRUNCATE *\" || w1=\"*alter *\" || w1=\"*create *\" || w1=\"*drop *\" || w1=\"*grant *\" || w1=\"*revoke *\" || w1=\"*truncate *\")]"
      + id              = (known after apply)
      + log_group_name  = "/aws/rds/cluster/notification-canada-ca-production-cluster/postgresql"
      + name            = "Postgresql dangerous queries"
      + role_arn        = (known after apply)
    }

  # aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-watch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/rds/cluster/notification-canada-ca-production-cluster/postgresql:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-postgres"
      + statement_id_prefix = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.logs_exports"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.pgaudit"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

36 tests, 19 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
